---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.UnstableConstraintInFamily
source: html/75c8c8fa-b61d-832c-bcec-f438b7ee3e10.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.UnstableConstraintInFamily Property

Constraints between geometry in the family can behave unpredictably on parameter modification. To make the family reliable, constrain geometry to levels, reference planes, or reference lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnstableConstraintInFamily { get; }
```